#-*- coding: utf-8 -*- 

import numpy as np
import pandas as pd

df1 = pd.read_csv('./data/csv/비트컴퓨터 1120.csv',
                  index_col=0,
                  header=0,
                  encoding='cp949',
                  sep=',')
bit = df1.sort_values(['일자'], ascending=['True'])
#print(bit)
#print(bit.shape) #(1200, 16)
#               시가    고가     저가    종가 전일비    Unnamed: 6    등락률      거래량   금액(백만)   신용비       개인      기관   외인(수량)   외국계   프로그램  외인비
# 일자
# 2016/01/04   7,800   7,830   7,490   7,570   ▼       -200         -2.57     371,546       2,840    5.27       6,046        0      77,213    1,829        0    2.74
# 2016/01/05   7,700   8,240   7,690   7,930   ▲        360          4.76   1,463,980      11,726    5.19     -48,331   94,294     -39,284  -40,048        0    2.50
# 2016/01/06   8,020   8,210   7,720   7,970   ▲         40          0.50     570,843       4,549    5.28      23,943     -785     -22,890  -23,258        0    2.37
# 2016/01/07   7,970   8,150   7,840   7,950   ▼        -20         -0.25     351,143       2,803    5.20        -441    5,325      -5,017   -5,017        0    2.34

df2 = pd.read_csv('./data/csv/삼성전자 1120.csv',
                  index_col=0,
                  header=0,
                  encoding='cp949',
                  sep=',')
          

samsung = df2.sort_values(['일자'], ascending=['True'])
print(samsung.shape)
#print(samsung)
#print(samsung.shape) #(1200, 16)
#                  시가        고가       저가        종가 전일비  Unnamed: 6      등락률      거래량     금액(백만)   신용비          개인        기관    외인(수량)     외국계     프로그램    외인비
# 일자
# 2020/11/20     63,900     65,000     63,900     65,000     ▲          400       0.62   4,389,086       282,438     0.00            0           0            0   -482,304    -604,078    56.53
# 2020/11/19     64,100     64,800     63,900     64,600     ▼         -200      -0.31  16,590,290     1,066,785     0.06    1,556,019    -966,779     -591,219   -766,372  -1,013,537    56.53
# 2020/11/18     65,700     66,200     64,700     64,800     ▼         -900      -1.37  22,963,790     1,495,191     0.06    1,031,862     372,944   -1,297,242   -943,301  -2,310,858    56.54